DataProcessors/ЛЕО_ФормированиеЦен_ПоПриходу/ЛЕО_ФормированиеЦен_ПоПриходу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛЕО_ФормированиеЦен_ПоПриходу</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ДатаЦенСкидок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСвойстваИКатегории</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчета</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыЦенСкидок</name>
    <attributes>
      <name>ТипЦенСкидок</name>
      <type>
        <types>CatalogRef.ТипыСкидокНаценок</types>
        <types>CatalogRef.ТипыЦенНоменклатурыКонтрагентов</types>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаЦены</name>
      <type>
        <types>EnumRef.СпособыРасчетаЦены</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаБазовая</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <type>
      <types>EnumRef.СтатусыПартийТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументЗакупки</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщикуИзНТТ</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПоступлениеДопРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслугВНТТ</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПоступлениеТоваровИзПереработки</types>
      <types>DocumentRef.ГТДИмпорт</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ЦеныНоменклатурыКонтрагентов/ЦеныНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыКонтрагентов</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатурыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/ТипыЦенНоменклатуры/ТипыЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЦенНоменклатуры</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ВалютаЦены</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассчитывается</name>
    <comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <comment>(Общ) Истина - цена включает НДС, ложь - не включает</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВБольшуюСторону</name>
    <comment>(Общ) Истина, то при порядке округления &quot;5&quot; 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦены</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦены</types>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/ЛЕО_ФормированиеЦен_ПоПриходу/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мКоманда Экспорт;

Перем мСписокНоменклатуры Экспорт;
Перем мКонтрагент Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Заполняет параметры построителя отчета.
//
Процедура ЗаполнитьОбщиеПараметрыПостроителяОтчета()

	ДопКолонка   = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	//ВыводитьКоды = Истина;
	Если ДопКолонка <> Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить Тогда
		ИмяКолонкиКодов = Строка(ДопКолонка);
	//Иначе
	//	ВыводитьКоды = Ложь;
	КонецЕсли;

	ПостроительОтчета.Параметры.Вставить("ДатаЦенСкидок", ДатаЦенСкидок);
	ПостроительОтчета.Параметры.Вставить("ПустаяСтрока", "");
	ПостроительОтчета.Параметры.Вставить("ДопКолонка", ДопКолонка);
	ПостроительОтчета.Параметры.Вставить("Артикул", Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул);
	ПостроительОтчета.Параметры.Вставить("Код", Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код);
	ПостроительОтчета.Параметры.Вставить("ПустаяХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

КонецПроцедуры // ЗаполнитьОбщиеПараметрыПостроителяОтчета()
  // Формирует и заполняет построитель отчета по регистру "ЦеныНоменклатуры"
//
Процедура ЗаполнитьПостроительОтчетаПоЦенеПоступления(ВключатьНезаполненные, ЗаполнятьТолькоТекстЗапроса) Экспорт
         ТекстЗапроса = "ВЫБРАТЬ
                        |	ДокументНоменклатура.Номенклатура КАК Номенклатура,
                        |	ДокументНоменклатура.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                        |	ДокументНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
                        |	МАКСИМУМ(ДокументНоменклатура.Цена) КАК Цена,
                        |	Константы.ВалютаУправленческогоУчета КАК Валюта,
                        |	&ТипЦен
                        |ИЗ
                        |	(ВЫБРАТЬ
                        |		Закупки.Номенклатура КАК Номенклатура,
                        |		МАКСИМУМ(Закупки.ДокументЗакупки.Дата) КАК ДокументЗакупкиДата
                        |	ИЗ
                        |		РегистрНакопления.Закупки КАК Закупки
                        |	ГДЕ
                        |		Закупки.Регистратор.Дата >= ДОБАВИТЬКДАТЕ(&ДатаТекущая, ГОД, -1)
                        |		И ТИПЗНАЧЕНИЯ(Закупки.Регистратор) = ТИП(Документ.ПоступлениеТоваровУслуг)
                        |	
                        |	СГРУППИРОВАТЬ ПО
                        |		Закупки.Номенклатура) КАК МаксДата
                        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
                        |			Закупки.Номенклатура КАК Номенклатура,
                        |			Закупки.ДокументЗакупки.Дата КАК ДокументЗакупкиДата,
                        |			Закупки.Регистратор КАК Регистратор,
                        |			СУММА(Закупки.Количество) КАК Количество,
                        |			СУММА(Закупки.Стоимость) КАК Стоимость,
                        |			СУММА(Закупки.НДС) КАК НДС,
                        |			Закупки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
                        |			Закупки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
                        |			0 КАК ПроцентСкидкиНаценки,
                        |			ВЫБОР
                        |				КОГДА Закупки.Количество = 0
                        |						ИЛИ Закупки.Стоимость = 0
                        |					ТОГДА 0
                        |				ИНАЧЕ ВЫРАЗИТЬ((Закупки.Стоимость - Закупки.НДС) / Закупки.Количество КАК ЧИСЛО(10, 2))
                        |			КОНЕЦ КАК Цена
                        |		ИЗ
                        |			РегистрНакопления.Закупки КАК Закупки
                        |		ГДЕ
                        |			Закупки.Регистратор.Дата >= ДОБАВИТЬКДАТЕ(&ДатаТекущая, ГОД, -1)
                        |			И ТИПЗНАЧЕНИЯ(Закупки.Регистратор) = ТИП(Документ.ПоступлениеТоваровУслуг)
                        |		
                        |		СГРУППИРОВАТЬ ПО
                        |			Закупки.Номенклатура,
                        |			Закупки.ДокументЗакупки.Дата,
                        |			Закупки.Регистратор,
                        |			Закупки.ХарактеристикаНоменклатуры,
                        |			Закупки.Номенклатура.ЕдиницаХраненияОстатков,
                        |			ВЫБОР
                        |				КОГДА Закупки.Количество = 0
                        |						ИЛИ Закупки.Стоимость = 0
                        |					ТОГДА 0
                        |				ИНАЧЕ ВЫРАЗИТЬ((Закупки.Стоимость - Закупки.НДС) / Закупки.Количество КАК ЧИСЛО(10, 2))
                        |			КОНЕЦ) КАК ДокументНоменклатура
                        |		ПО МаксДата.Номенклатура = ДокументНоменклатура.Номенклатура
                        |			И МаксДата.ДокументЗакупкиДата = ДокументНоменклатура.ДокументЗакупкиДата,
                        |	Константы КАК Константы
                        |{ГДЕ
                        |	ДокументНоменклатура.Номенклатура.*,
                        |	ДокументНоменклатура.ХарактеристикаНоменклатуры.*,
                        |	(&ТипЦен)}
                        |
                        |СГРУППИРОВАТЬ ПО
                        |	МаксДата.ДокументЗакупкиДата,
                        |	ДокументНоменклатура.Номенклатура,
                        |	ДокументНоменклатура.ХарактеристикаНоменклатуры,
                        |	ДокументНоменклатура.ЕдиницаИзмерения,
                        |	ДокументНоменклатура.ПроцентСкидкиНаценки,
                        |	Константы.ВалютаУправленческогоУчета
                        |
                        |УПОРЯДОЧИТЬ ПО
                        |	Номенклатура
                        |{УПОРЯДОЧИТЬ ПО
                        |	ДокументНоменклатура.Номенклатура.Артикул}";
	//Запрос.УстановитьПараметр("ДатаТекущая",ТекущаяДата());					
	//Запрос.УстановитьПараметр("ГруппыНоменклатуры",СписокГруппНоменклатуры);	
	
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	ПостроительОтчета.Параметры.Вставить("ДатаТекущая", 	ТекущаяДата());
	ПостроительОтчета.Параметры.Вставить("ТипЦен", 			Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000002382"));
	//ПостроительОтчета.Параметры.Вставить("Номенклатура", 	мСписокНоменклатуры);

	МассивОтбора = Новый Массив;
	
	МассивОтбора.Добавить("Номенклатура");
		
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

	ЗаполнитьОбщиеПараметрыПостроителяОтчета();
    
	 
КонецПроцедуры // ЗаполнитьПостроительОтчетаПоПлановымЦенам()

// Формирует и заполняет построитель отчета по регистру "ЦеныНоменклатуры"
//
Процедура ЗаполнитьПостроительОтчетаПоПлановымЦенам(ВключатьНезаполненные, ЗаполнятьТолькоТекстЗапроса) Экспорт

	Если ВключатьНезаполненные Тогда
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ВсяНоменклатура.Номенклатура,
			|	ВсяНоменклатура.ХарактеристикаНоменклатуры,
			|	СУММА(ЕСТЬNULL(РегПлан.Сумма, 0)) КАК Цена,
			|	Константы.ВалютаУправленческогоУчета КАК Валюта,
			|	ВсяНоменклатура.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
			|{ВЫБРАТЬ
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*}
			|ИЗ
			|	Константы КАК Константы,
			|	(ВЫБРАТЬ
			|		Характеристики.Ссылка КАК ХарактеристикаНоменклатуры,
			|		Характеристики.Владелец КАК Номенклатура
			|	ИЗ
			|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		&ПустаяХарактеристикаНоменклатуры,
			|		Номенклатура.Ссылка
			|	ИЗ
			|		Справочник.Номенклатура КАК Номенклатура
			|	ГДЕ
			|		(НЕ Номенклатура.ЭтоГруппа)) КАК ВсяНоменклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановаяСебестоимостьНоменклатуры.СрезПоследних(&ДатаЦенСкидок, ) КАК РегПлан
			|		ПО ВсяНоменклатура.Номенклатура = РегПлан.Номенклатура
			|			И ВсяНоменклатура.ХарактеристикаНоменклатуры = РегПлан.ХарактеристикаНоменклатуры
			|{ГДЕ
			|	ВсяНоменклатура.Номенклатура.*,
			|	ВсяНоменклатура.ХарактеристикаНоменклатуры.*}
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсяНоменклатура.Номенклатура,
			|	ВсяНоменклатура.ХарактеристикаНоменклатуры,
			|	Константы.ВалютаУправленческогоУчета,
			|	ВсяНоменклатура.Номенклатура.ЕдиницаХраненияОстатков
			|{ИТОГИ ПО
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*}
			|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		ТекстЗапроса = "
			|ВЫБРАТЬ
			|	РегПлан.Номенклатура,
			|	РегПлан.ХарактеристикаНоменклатуры,
			|	СУММА(РегПлан.Сумма) КАК Цена,
			|	Константы.ВалютаУправленческогоУчета КАК Валюта,
			|	РегПлан.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
			|{ВЫБРАТЬ
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*}
			|ИЗ
			|	РегистрСведений.ПлановаяСебестоимостьНоменклатуры.СрезПоследних(&ДатаЦенСкидок, ) КАК РегПлан,
			|	Константы КАК Константы
			|{ГДЕ
			|	РегПлан.Номенклатура.*,
			|	РегПлан.ХарактеристикаНоменклатуры.*,
			|	РегПлан.СтатьяЗатрат.*}
			|
			|СГРУППИРОВАТЬ ПО
			|	РегПлан.Номенклатура,
			|	РегПлан.ХарактеристикаНоменклатуры,
			|	Константы.ВалютаУправленческогоУчета
			|{ИТОГИ ПО
			|	Номенклатура.*,
			|	ХарактеристикаНоменклатуры.*}
			|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;

	ПостроительОтчета.Текст = ТекстЗапроса;

	Если Не ЗаполнятьТолькоТекстЗапроса Тогда

		МассивОтбора = Новый Массив;

		Если мСписокНоменклатуры = Неопределено Тогда
			МассивОтбора.Добавить("Номенклатура");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("Номенклатура",, "Номенклатура");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
			ЭлементОтбора.Значение      = мСписокНоменклатуры;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

		ЗаполнитьОбщиеПараметрыПостроителяОтчета();

	КонецЕсли;

КонецПроцедуры // ЗаполнитьПостроительОтчетаПоПлановымЦенам()

// Формирует и заполняет построитель отчета по регистру "ЦеныНоменклатуры"
//
Процедура ЗаполнитьПостроительОтчетаПоЦенамНоменклатуры(ВключатьНезаполненные, ЗаполнятьТолькоТекстЗапроса) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ //РАЗЛИЧНЫЕ
	|Тип.Ссылка                                                 КАК ТипЦен,
	|Ном.Ссылка                                                 КАК Номенклатура,
	|Ном.НоменклатурнаяГруппа                                   КАК НоменклатурнаяГруппа,
	|Ном.ЦеноваяГруппа                                          КАК ЦеноваяГруппа,
	|Ном.ЭтоГруппа                                              КАК ЭтоГруппа,
	|ХарактеристикиНоменклатуры.Ссылка                          КАК ХарактеристикаНоменклатуры,
	|Ном.Родитель                                               КАК Группа,
	|ВЫБОР
	|	КОГДА Ном.НаименованиеПолное ПОДОБНО &ПустаяСтрока 
	|	ТОГДА Ном.Наименование 
	|	ИНАЧЕ Ном.НаименованиеПолное КОНЕЦ                      КАК ПолноеНаименование,
	|ВЫБОР
	|	КОГДА &ДопКолонка = &Артикул
	|		ТОГДА Ном.Артикул
	|	КОГДА &ДопКолонка = &Код
	|		ТОГДА Ном.Код
	|	ИНАЧЕ
	|		NULL
	|	КОНЕЦ                                                   КАК Артикул,
	|Рег.ЕдиницаИзмерения                                       КАК ЕдиницаИзмерения,
	|Рег.Валюта,
	|Рег.ПроцентСкидкиНаценки                                   КАК ПроцентСкидкиНаценки,
	|Рег.СпособРасчетаЦены                                      КАК СпособРасчетаЦены,
	|Тип.ВалютаЦены,
	|КурсыВалют.Курс                                            КАК КурсВалюты,
	|КурсыВалют.Кратность                                       КАК КратностьВалюты,
	|КурсыВалютЦены.Курс                                        КАК КурсВалютыЦены,
	|КурсыВалютЦены.Кратность                                   КАК КратностьВалютыЦены,
	|ВЫБОР 
	|	КОГДА Тип.Рассчитывается ТОГДА
	|		Рег.Цена * (100 + Тип.ПроцентСкидкиНаценки)/100
	|	ИНАЧЕ
	|		Рег.Цена
	|	КОНЕЦ                                                   КАК Цена
	|
	|{ВЫБРАТЬ
	|	Тип.Ссылка.*                                            КАК ТипЦен,
	|	Ном.Ссылка.*                                            КАК Номенклатура,
	|	Ном.Родитель.*                                          КАК Группа
	|	//СВОЙСТВА
	|}
	|
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|	//СОЕДИНЕНИЯ
	|
	|СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		Характеристики.Ссылка   КАК Ссылка,
	|		Характеристики.Владелец КАК Владелец
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Ссылка,
	|		Номенклатура.Ссылка               КАК Владелец
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|
	|	) КАК ХарактеристикиНоменклатуры
	|ПО
	|	ХарактеристикиНоменклатуры.Владелец = Ном.Ссылка
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК Тип
	|ПО
	|	ИСТИНА
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЦенСкидок, {
	|	   ТипЦен.* КАК ТипЦен,
	|	   Номенклатура.* КАК Номенклатура,
	|	   Номенклатура.НоменклатурнаяГруппа.* КАК НоменклатурнаяГруппа,
	|	   Номенклатура.ЦеноваяГруппа.* КАК ЦеноваяГруппа,
	|	   Номенклатура.Родитель.* КАК Группа
	|	}) КАК Рег
	|ПО
	|	Тип.Ссылка = Рег.ТипЦен
	|	И
	|	Ном.Ссылка = Рег.Номенклатура
	|	И
	|	Рег.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЦенСкидок) КАК КурсыВалют
	|ПО
	|	КурсыВалют.Валюта = Рег.Валюта
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЦенСкидок) КАК КурсыВалютЦены
	|ПО
	|	КурсыВалютЦены.Валюта = Тип.ВалютаЦены
	|ГДЕ
	|	НЕ Ном.Набор
	|";

	Если Не ВключатьНезаполненные Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И Рег.ТипЦен ЕСТЬ НЕ NULL
		|";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|{ГДЕ
	|	Тип.Ссылка.*                  КАК ТипЦен,
	|	Ном.Ссылка.*                  КАК Номенклатура,
	|	НоменклатурнаяГруппа.Ссылка.* КАК НоменклатурнаяГруппа,
	|	ЦеноваяГруппа.Ссылка.*        КАК ЦеноваяГруппа,
	|	Ном.Родитель.*                КАК Группа
	|	//СВОЙСТВА
	|	//КАТЕГОРИИ
	|}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ТипЦен
	|	//СВОЙСТВА
	|
	|ИТОГИ ПО 
	|	Номенклатура ТОЛЬКО ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ
	|";

	ПостроительОтчета.Текст = ТекстЗапроса;

	Если Не ЗаполнятьТолькоТекстЗапроса Тогда

		// Соответствие имен полей в запросе и их представлений в отчете
		СтруктураПредставлениеПолей = Новый Структура(
		"	ТипЦен, 
		|	Номенклатура,
		|	НоменклатурнаяГруппа,
		|	ЦеноваяГруппа",
		"Тип цен",
		"Номенклатура",
		"Номенклатурная группа",
		"Ценовая группа");

		УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);

		// отборы по умолчанию
		Пока ПостроительОтчета.Отбор.Количество() > 0 Цикл
			ПостроительОтчета.Отбор.Удалить(0);
		КонецЦикла;

		МассивОтбора = Новый Массив;

		Если ТипыЦенСкидок.Количество() = 0 Тогда
			МассивОтбора.Добавить("ТипЦен");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ТипЦен",, "Тип цен");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
			ЭлементОтбора.Значение.ЗагрузитьЗначения(ТипыЦенСкидок.ВыгрузитьКолонку("ТипЦенСкидок"));
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		
		Если мСписокНоменклатуры = Неопределено Тогда
			МассивОтбора.Добавить("Номенклатура");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("Номенклатура",, "Номенклатура");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
			ЭлементОтбора.Значение      = мСписокНоменклатуры;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		
		МассивОтбора.Добавить("НоменклатурнаяГруппа");
		МассивОтбора.Добавить("ЦеноваяГруппа");
		
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

		ЗаполнитьОбщиеПараметрыПостроителяОтчета();

	КонецЕсли;

КонецПроцедуры // ЗаполнитьПостроительОтчетаПоЦенамНоменклатуры()

// Формирует и заполняет построитель отчета по регистру "ЦеныНоменклатурыКонтрагентов"
//
// Возвращаемое значение:
//   Текст запроса
//
Процедура ЗаполнитьПостроительОтчетаПоЦенамНоменклатурыКонтрагентов(ВключатьНезаполненные, ЗаполнятьТолькоТекстЗапроса) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|
	|ТаблицаТоваров.ТипЦен КАК ТипЦен,
	|ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|ТаблицаТоваров.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|ТаблицаТоваров.Номенклатура.Родитель КАК Родитель,
	|ВЫБОР
	|	КОГДА ТаблицаТоваров.Номенклатура.НаименованиеПолное ПОДОБНО &ПустаяСтрока
	|	ТОГДА ТаблицаТоваров.Номенклатура.Наименование 
	|	ИНАЧЕ ТаблицаТоваров.Номенклатура.НаименованиеПолное КОНЕЦ КАК ПолноеНаименование,
	|ВЫБОР
	|	КОГДА &ДопКолонка = &Артикул
	|		ТОГДА ТаблицаТоваров.Номенклатура.Артикул
	|	КОГДА &ДопКолонка = &Код
	|		ТОГДА ТаблицаТоваров.Номенклатура.Код
	|	ИНАЧЕ
	|		NULL
	|	КОНЕЦ КАК Артикул,
	|ЦеныНоменклатурыКонтрагентов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|ЦеныНоменклатурыКонтрагентов.Валюта КАК Валюта,
	|NULL                                                       КАК ПроцентСкидкиНаценки,
	|ЦеныНоменклатурыКонтрагентов.Цена                          КАК Цена,
	|NULL                                                       КАК СпособРасчетаЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&ДатаЦенСкидок,
	|																				{ТипЦен.Владелец.* КАК Контрагент,
	|																				 ТипЦен.* КАК ТипЦен,
	|																				 Номенклатура.* КАК Номенклатура,
	|																				 Номенклатура.Родитель.* КАК Группа}
	|															   ) КАК ЦеныНоменклатурыКонтрагентов	
	|";

	Если ВключатьНезаполненные Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ПРАВОЕ СОЕДИНЕНИЕ
		|
		|(
		|	ВЫБРАТЬ Товары.*, Цены.Ссылка КАК ТипЦен
		|	ИЗ
		|		(
		|			ВЫБРАТЬ Владелец КАК Номенклатура, Ссылка КАК ХарактеристикаНоменклатуры ИЗ Справочник.ХарактеристикиНоменклатуры
		|			{ГДЕ ХарактеристикиНоменклатуры.Владелец.* КАК Номенклатура, ХарактеристикиНоменклатуры.Владелец.Родитель.* КАК Группа}
		|			ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ Ссылка, &ПустаяХарактеристикаНоменклатуры ИЗ Справочник.Номенклатура
		|			{ГДЕ Номенклатура.Ссылка.* КАК Номенклатура, Номенклатура.Родитель.* КАК Группа}
		|		) КАК Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|	(
		|		ВЫБРАТЬ Ссылка ИЗ Справочник.ТипыЦенНоменклатурыКонтрагентов
		|		{ГДЕ Владелец.* КАК Контрагент, Ссылка.* КАК ТипЦен}
		|	) КАК Цены
		|	ПО ИСТИНА
		|
		|
		|) КАК ТаблицаТоваров
		|
		|ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыКонтрагентов.Номенклатура 
		|И ТаблицаТоваров.ХарактеристикаНоменклатуры = ЦеныНоменклатурыКонтрагентов.ХарактеристикаНоменклатуры";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО 
	|	ЦеныНоменклатурыКонтрагентов.Период,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыКонтрагентов.ТипЦен
	|
	|АВТОУПОРЯДОЧИВАНИЕ";

	Если НЕ ВключатьНезаполненные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаТоваров", "ЦеныНоменклатурыКонтрагентов");
	КонецЕсли;

	ПостроительОтчета.Текст = ТекстЗапроса;
	ПостроительОтчета.Параметры.Вставить("ПустойТипЦен", Справочники.ТипыЦенНоменклатуры.ПустаяСсылка());

	Если Не ЗаполнятьТолькоТекстЗапроса Тогда

		// Соответствие имен полей в запросе и их представлений в отчете
		СтруктураПредставлениеПолей = Новый Структура(
		"	ТипЦен, 
		|	Номенклатура",
		"Тип цен",
		"Номенклатура");

		УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);

		// отборы по умолчанию
		Пока ПостроительОтчета.Отбор.Количество() > 0 Цикл
			ПостроительОтчета.Отбор.Удалить(0);
		КонецЦикла;

		МассивОтбора = Новый Массив;
		Если мКонтрагент = Неопределено Тогда
			МассивОтбора.Добавить("Контрагент");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("Контрагент",, "Контрагент");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
			ЭлементОтбора.Значение      = мКонтрагент;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		Если ТипыЦенСкидок.Количество() = 0 Тогда
			МассивОтбора.Добавить("ТипЦен");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("ТипЦен",, "Тип цен");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
			ЭлементОтбора.Значение.ЗагрузитьЗначения(ТипыЦенСкидок.ВыгрузитьКолонку("ТипЦенСкидок"));
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		Если мСписокНоменклатуры = Неопределено Тогда
			МассивОтбора.Добавить("Номенклатура");
		Иначе
			ЭлементОтбора = ПостроительОтчета.Отбор.Добавить("Номенклатура",, "Номенклатура");
			ЭлементОтбора.ВидСравнения  = ВидСравнения.ВСписке;
			ЭлементОтбора.Значение      = мСписокНоменклатуры;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

		ЗаполнитьОбщиеПараметрыПостроителяОтчета();

	КонецЕсли;

КонецПроцедуры // ЗаполнитьПостроительОтчетаПоЦенамНоменклатурыКонтрагентов()

мСписокНоменклатуры = Неопределено;
мКонтрагент         = Неопределено;

#КонецЕсли
